{"Amanita muscaria": "Dimensions Cap 8-10 cm diameter; stem 8-18 cm tall * 1-2 cm diameter Description Medium to large, fleshy agaric, cap red or some shade of orange, with white patches, white gills, ring, bulbous base. Grows on poor and sandy soils.\n\nCap Rounded to flat, often with a low, shallow depression on disk when fully expanded. Surface shiny; deep scarlet, fading to orange-red or orange-yellow in older specimens. Gills white, free or barely touching the stem, crowded. Stem Typically robust, but separating readily from cap. Color white or ivory, smooth or slightly sculptured, often with velar fragments in several warty rings immediately above the basal bulb. Ring white or tinged yellow, membranous, persistent.", "Amanita pantherina": "Dimensions Cap 5-10 cm diameter, stem 8-12 cm tall * 1-1.5 cm diameter Description Medium to large fleshy agaric with brownish cap, pure white patches, white stem, ring, bulbous base with distinct margin.\nCap brown with ochraceous tinge; at first convex, becoming expanded-convex and the flattened, decorated with pure white velar remnants. Flesh white, thick on disc center but tapers abruptly on limb to a thin margin. Gills white, free, crowded. Stem white, tapering upwards, with belt-like velar remnants below the ring, basal bulb sheathed by small, white volval sac. Ring white, pendolous thin, superior, but sometimes with a toothed edge.", "Amanita phalloides": "Dimensions Cap 6-12 cm diameter, stem 7-12 cm tall * 1 - 1.5 cm thick Description Medium to large, fleshy mushroom with greenish olive cap, whitish stem, ring, no patches but distinctive volval sheath.\n\nCap Nearly round to convex at first, expanding to flat, often with a broad hump. Color greenish, with yellow or olivacreous tinges, with radiating silky fibrils. Gills free, close, white to cream colored. Stem white or tinged cap colour, tapering upwards, sometimes sculpted into faint bands, basal bulb sheathed by, large, loose, white volval sac. Ring white or colored like the stem, broad, thin, persistent.\n\nSimilar species Some Volvariella species look similar to older speciemens of Amanita phalloides. They are distinguished by a pale pink spore deposit and lack of a stem ring.", "Amanita porphyria": "Dimensions Cap 4-10 cm diameter; stem 5-12 cm tall * 1-1.5 cm diameter Description Medium to large, fleshy agaric, cap greyish brown or some shade of brown, sometimes with grey patches, white gills, ring, bulbous base. Grows near coniferous trees.\n\nCap Hemispherical when young, later flat. It is 4–10 cm in diameter, greyish brown to brown in colour, usually smooth, sometimes with grey patches. Gills white and free from the stem. The spores are white. Stem The stem is 5–12 cm high and 1-1.5 cm thick and has a grey to black ring. The stem has a basal bulb. The flesh is white with a smell of radish.\n\nSimilar species Amanita porphyria can easily be confused with much more poisonous species such as the Panther cap (Amanita pantherina).", "Amanita regalis": "Dimensions Cap 5-10 cm diameter, stem 6-12 cm tall * 1.5-2.5 cm thick Description Medium to large, brown, fleshy agaric with cap patches, white gills, ring, basal bulb. Grows solitary or scattered on soil in mixed woods.\n\nCap brown; at first convex, becoming expanded-convex or flattened, smooth and slightly greasy in damp conditions, decorated with delicate, non-persistent, whitish or whitish grey velar patches. Flesh white firm and medium.\nGills are crowded close together, free from attachment to the stem, and white with a creamy yellow tinge. Stem white, smooth, lined above the ring. Ring large white and fairly firm, superior.", "Amanita rubescens": "Dimensions Cap 6-15 cm diameter, stem 6-15 cm tall * 1-2.5 cm thick Description This large, rosy-brown, fleshy agaric has cap patches, white gills, a bulbous base and ring on stem. Bruising reddish, it grows solitary or scattered on soil in woods generally.\n\nCap is dull reddish brown or buff. It is sometimes spotted and decorated with warty velar remnants that are pallid clay to reddish. At first it is sub-spherical, becoming convex and finally flattened. Flesh is white, becoming convex and finally flattened. Flesh is moderately firm and white, becoming brownish pink where cut or damaged. Gills are free, crowded and white, spotted brownish pink when bruised or aged. Spores are white. Stem is white or pallid clay above the ring but below it is a flushed cap color often with patterning; it bruises reddish brown. The basal bulb may retain small rows of volval patches but without gutter. Flesh is at first white, then spotted brownish pink when bruised and old. It is firm, becoming spongy and stuffed.  Ring is membraneous, lax and superior.\n", "Amanita virosa": "Dimensions Cap 5-9 cm diameter, stem 13-20 cm tall * 1.5-2 cm diameter Description Large, white fleshy agaric with a shaggy stalk and volval bag, solitary or scattered on soil in broad-leaf or mixed woods.\nCap pure white, at first conical, becoming campanulate and finally irregularly expanded, but often retaining a flat umbo. Flesh white and firm.\nGills white, free, crowded. Stem white, shaggy or fibrous, typically curved, arising from large bag-like vulva often buried deep in the soil. Ring large, fragile and typically ruptured. Taste DO NOT ATTEMPT TO TASTE ANY PART OF THE SPECIMEN.\n\nSimilar species Amanita bisporigera is a smaller, more slender, two-spored, but equally deadly mushroom. ", "Boletus satanas": "Dimensions Cap 8-25 cm diameter, stem 6-9 cm tall * 5-10 cm diameter Description This fleshy species has a smooth, bun-shaped cap that is almost white. Boletus satanas is best identified by its orange to blood-red pores and prominent yellow to blood-red net pattern. It also has a fat, yellow to red stem.\n\nCap is chalk-white and convex or bun shaped, becoming expanded with age. At first, it is finely downy, then smooth. Flesh is also chalk-white or pallid cream white. It flushes rose where eaten and slowly pallid blue where cut. Pores are small, circular and red, sometimes blood-red, but orange at margin. Tubes are yellow then olive, blue where cut, and broadly attached to the stem. Stem is yellow above with red net and then halfway it is wholly red, stout and very bulbous. Ring is absent. Flesh is fairly firm; it is pallid lemon above, dirty white below, reacting as in cap but red in base.\n"}{"Coprinus atramentarius": "Dimensions Cap 3-7 cm tall * variable diameter, stem 7-14 cm tall * 1-1.5 cm thick Description This conical agaric is medium-sized, greyish brownish and later blackening; it grows generally in tufts, in fields, gardens and waste ground, near broad-leaf tree stumps or buried wood. It sometimes pushes up through tarmac paths and less frequently near the bases of living trees.\n\nCap is brown or dirty greyish brown, centre has more rust color with scurfy brown scales (velar remnants); at first ovoid, then bell-shaped, it is broadly conical and finally reflexed at the margin, marked with parallel grooves often splitting. Auto-digesting flesh is white, hollow and medium in young specimens but soon discolors. It is fairly thin and fragile in relation to size. Gills are free and crowded, at first white but rapidly becoming grey-brown and finally black. Spores are black. Stem is white and smooth. There is a ring-like zone near the base.\n\nSimilar species Coprinus insignis has warty spores. Coprinus micaeus is smaller and more fragile. It granulates when young.\n", "Cortinarius rubellus": "Dimensions Cap 3-8 cm diameter, stem 5-11 cm tall * 0.8-1.5 cm diameter Description This lethally poisonous mushroom, which smells of radishes, is reddish orange with a pointed, umbonate cap covered with fibrils. The cylindrical to club-shaped, orange-brown stem has pale yellow to ocher bands indicating the veil remnants. The medium-spaced, adnexed to adnate gills are pale ocher-brown, darkening to deep rust-brown with age.\n\nSimilar species Cortinarius limonius, also poisonous, has more vivid orange coloring. Cortinarius orellanus has a less conical cap and grows near decidous trees.", "Cortinarius semisanguineus": "Dimensions Cap 2-6 cm diameter, stem 2-10 cm tall * 0.4-1 cm thick Description This smallish agaric has a yellowish tan cap, blood red gills, and yellowish stem not swollen at base. It grows typically with conifers and birch.\n\nCap is smooth and an olive tinged tan, sometimes with reddish tinge at centre; it is at first convex, becoming expanded-umbonate. Flesh is an olive tinge and fairly thin. Gills are at first reddish purple, becoming blood-red and finally more reddish rust. They are broadly attached to the stem , irregular, and fairly crowded. Spores are rusty brown. Stem is a pallid cap color streaked with olive tinged fibrils below, more or less equal, downy at base and sometimes slightly swollen. Ring is absent. Flesh is ochre, fibrous and full.\n\nSimilar species Cortinarius phoniceus has a redder cap and more distinct red veil girdles around the stem.\n", "Galerina marginata": "Dimensions Cap 2.5-6.5 cm diameter, stem 3-9 cm tall * 0.3-0.8 cm diameter Description Small agaric, with yellowish tan, sticky cap, similarly colored as thegills and ring on stem; it clusters on stumps and logs of broad-leaf trees.\nCap is brown and dries yellow. It has a convex shape, becoming flattened with a blunt umbo color. Gills are the same color as the cap, broadly attached to the stem and crowded. Stem is slender and fibrous.  At first a dark tan below the brown ring, stem lightens in color as it connects with the surface. \n", "Gyromitra esculenta": "Dimensions 5-15 cm diameter, 5-12 cm tall, including stem Description Irregular, brown, brain-like structure on a pale stem. Grows solitary or in small trooping groups near conifers (pines), typically on acid, sandy soils.\n\nFruiting body Outer surface reddish brown, irregularly lobed and convoluted, brain-like. Stem white, short, stout, deeply furrowed and finely granular. Flesh yellowish ochre in cap, white in stem, brittle, medium and hollow.\n\nWarning This mushroom is deadly poisonous. Toxins allegedly lost after thorough cooking but, if ingested, the effect is probably cumulative with no immediate symptoms.\n\nSimilar species Gyromitra gigas, Gyromitra brunna, Gyromitra caroliniana and Gyromitra korfii are often larger and more vivid orange-brown; common in parts of North America.", "Hebeloma crustuliniforme": "Dimensions Cap 2-10 cm diameter, stem 4-7 cm tall * 1-2 cm thick Description Medium to large agaric with buff or tan, greasy cap, clay gills and stoutish, pale stem. Grows solitary or in small groups on soil in open mixed woodland.\n\nCap buff or ochraceous-tan, darker at centre; at first convex, becoming expanded with a broad low umbo, smooth, greasy when damp. Flesh white and thick. Gills pallid clay-brown, spotted with age, exuding watery droplets in damp conditions, adnate or adnexed, crowded. Spores are rust colored. Stem whitish, fairly stout, more or less equal, granular towards apex. Ring absent. Flesh white, firm and stuffed.\n\nSimilar species Related species, such as Hebeloma edurum, Hebeloma leucosarx, and Hebeloma sinapizans, have similar smell of radishes or sometimes a hint of cocoa, and are distinguished by spore size and shape.", "Hebeloma longicaudum": "Dimensions Cap 3-6 cm diameter, stem 7-12 cm tall * 0.4-0.8 cm thick Description This medium-sized agaric has a pale creamy-brown cap, clay gills and a long, stout, pale stem. It grows often in dense moorland and grass.\n\nCap is smooth, greasy when damp, and pallid ochre with a brown tinge; it is at first convex, becoming expanded with a broad low umbo. Flesh is white and thick. Gills are pallid clay-brown, spotted with age, broadly attached to the stem or reaching downward but not attached, and crowded. They exude watery droplets in damp conditions. Spores are rust brown. Stem is similarly colored as the cap, elongated, more or less equal but slightly bulbous at base, granular towards apex, and otherwise finely fibrous. Ring is absent, firm and stuffed.\n", "Hebeloma mesophaeum": "Dimensions Cap 2.5-4.5 cm diameter, stem 4-7 cm tall * 0.3-0.4 cm thick Description Smallish agaric, cap with greasy, dark brown centre and paler margin, clay gills and pale stem with ring. Grows solitary or in small groups on soil, with conifers, less frequently with broad-leaf trees on late summer to autumn.\n\nCap darkish date- or chocolate-brown at centre with pallid whitish margin decorated with fibrous velar remnants when young. The cap is at first convex, becoming expanded with a broad low umbo, greasy or viscid when damp. Flesh white and thin. Gills pallid clay-brown, adnate or adnexed, crowded. Spores are rust colored. Stem pallid buff, becoming tinged brown with age, more or less equal. Ring zone-like, fibrillose. Flesh brownish, firm and stuffed.\n\nSimilar species Relatives such as Hebeloma candidipes are distinguished by microscopic examination."}{"Hypholoma fasciculare": "Dimensions Cap 2-7 cm diameter, 4-10 cm tall * 0.5-1 cm diameter Description This medium-sized agaric has a yellowish tan cap and stem, sulphur or blackish brown gills, and a faint ring zone; in dense tufts, it often grows on stumps of broad-leaf and coniferous trees.\nCap is sulphur-yellow and tan towards the centre; it is convex with a slight umbo at the centre of the cap.  It is expanded with age, smooth but with velar remnants attached to the margin. Flesh is sulphur-yellow, firm and moderate. Gills are at first sulphur-yellow, then more olive tinged and finally blackish brown; they are broadly attached to the stem and crowded. Stem is more or less similarly colored as the cap, but it is darker brown towards the base. Ring is zone-like, faint, and with maturity colorcolored with spores.\n\n\n", "Lactarius helvus": "Dimensions Cap 4-10 cm diameter; stem 3-6 cm tall * 1-2.3 cm diameter Description This medium-sized or large agaric has a cinnamon-brown cap, buff gills and excluding milk; it grows solitary or in scattered groups on soil.\nCap is cinnamon-brown with reddish tinge; it is at first convex, then flattened or slightly depressed. Flesh is moderate, whitish with a buff tinge, and at first firm then soft. Gills are pallid buff with ochre tinge, becoming more ochre-brown with age; they are slightly extended downward, narrow, and close. Stem is similarly colored as the cap or more reddish brown, more or less equal. Ring is absent.\n\nSimilar species Lactarius aquifluus is very similar in appearance and grows in North America.\n", "Paxillus involutus": "Dimensions Cap 5-12 cm diameter, stem 3-7 cm tall * 0.8-1.2 cm diameter Description This large agaric has a sometimes greasy, brown cap, and stem, and ochre-brown gills; it grows solitary or in trooping groups on soil in leaf woods.\n\nCap is at first a dull reddish-yellow color with an olive tinge, it becomes more hazel-brown; at first convex, it becomes expanded and depressed but with persistently inrolled margin. It is especially downy at margin, greasy at centre when damp, and smooth with age. Flesh is pallid ochre, thick and firm. Gills, crowded and extending downward, are at first pallid ochre and then become brown and spotted rust with age or bruisingextending downward. Stem is similarly colored as the cap, however bruising darker brown. It is smooth, equal or tapering downwards. Ring is absent.\n\nSimilar species Paxillus filamentous has a less incurved margin, yellow flesh, and occurs under alder.\n", "Russula emetica": "Dimensions Cap 3-10 cm diameter, stem 4-9 cm tall * 0.7-2 cm thick Description This medium-sized agaric has a distinctive scarlet-red cap, brittle creamy-white gills and white stem.\n\nCap is scarlet or cherry red, sometimes with more pallid areas; it is at first convex, flattened and slightly depressed. It is slightly sticky when damp and sometimes sulcate at margin when old, cuticle peeling fully. Gills are whitish, becoming pallid straw, more or less free, brittle, and narrow. Spores are white. Stem is smooth, white, more or less equal or slightly elevated at base. Ring is absent. Flesh is white, fragile and stuffed.\n\nSimilar species Russula silvicola is the common dry woodland species across North America. Russula fageticola usually grows under beech trees, and it also tastes hot. Amanita muscaria has veil patches on the cap, a stem ring, and a bulb.\n", "Stropharia hornemannii": "Dimensions Cap 6-15 cm diameter, stem 6-12 cm tall * 1-2 cm thick Description Medium-sized to large agaric with a large slimy purple or olive cap; gills become purple with age; the stalk is long and richly decorated with pieces of the white sheath that extends up to a prominent ring."}{"Agaricus arvensis": "Dimensions Cap 8-20 cm diameter, stem 8-10 cm tall * 2-3 cm diameter Description This large, sometimes massive agaric has a white cap, ringed stem, and pink or chocolate colored gills.\n\nCap is white or cream colored, yellowing slightly with age or on bruising; smooth or finely scaly, cap is at first ovoid, becoming convex and later expanded. Flesh is white, firm and thick. Gills are at first white, becoming pink, then chocolate brown or blackish, free and crowded. Stem is white or cream; it is slightly club-shaped and smooth or finely scaly below the ring. Ring is white or cream, pendulous and superior.\n\nSimilar species There are several similar species. Agaricus macrosporus are very fleshy, with scaly stem girdles. Agaricus sylvicola is a woodland variety. Agaricus augustus and Agaricus xanthoderma are also similar. Be careful not to confuse it with the deadly poisonous Amanita virosa, which has white gills.", "Agaricus augustus": "Dimensions Cap 10-20 cm diameter, stem 10-20 cm tall * 2-4 cm diameter Description Tall, sometimes massive agaric, scaly cap on a thick stalk. Stalk scaly below ring. Surfaces of all parts stain yellow when handled or bruised. \nCap Convex at first, often flattened on disc, expanding slowly to a flat cap, sometimes with a broad, low hump. Chestnut, soon breaking up into fibrous scales in more or less concentric rings against a yellow-tinged background. Flesh whitish, firm and thick. Gills at first pallid pink, becoming chocolate brown or blackish at maturity. Stem Solid; cylindrical to club-shaped. The surface is white. Ring membranous, with patches of brownish fibrils under. \n\nSimilar species Agaricus subrefescens found in central and eastern U.S.", "Albatrellus ovinus": "Dimensions Cap 7-18 cm diameter, stem 3-7 cm tall * 1-3 cm thick Description From above, this creamy to pale gray-brown polypore looks like an agaric or a hedgehog mushrooom, but it has minute pores on the underside. It stains lemon or greenish yellow, particularly on the pores. The skin of the convex cap often cracks with age. It has a sturdy stem and very firm, mild to slightly bitter white flesh. Grows under conifers, mycorrhizal with spruce on moss-covered soil.\n\nSimilar species Albatrellus confluens is more orange and does not stain yellow; it tastes bitter.\n", "Armillaria mellea": "Dimensions Cap 3-15 cm diameter, stem 6-15 cm tall * 0.5-1.5 cm thick Description This large agaric has a convex, flattened, or wavy, olive-tinged, pale yellow-brown cap with a darker center and sparse pale scales. Grows in dense caespitose clusters on and around the stumps of leaf and coniferous trees.\n\nCap variable through ochraceous, tawny and dark brown, covered in darker fibrillose scales, more so towards the centre; at first convex, becoming flattened and wavy. Flesh white, thin and firm. Gills at first white, becoming yellowish and then brown, with darker spots in old specimens, decurrent, broad and crowded. Stem at first whitish, becoming yellowish or reddish brown, more or less equal or tapering towards the base, finely wholly. Ring yellowish, cottony or woolly, superior, fairly persistent.", "Boletus badius": "Dimensions Cap 4-14 cm diameter, stem 4-12 cm tall * 1-4 cm diameter Description This large bolete with bay-brown cap and lemon-yellow pores bruises distinctively bluish green.\n\nCap is bay-brown, sometimes with brick-red or ochre tinges; convex or bun-shaped, it is at first downy, becoming smooth and polished, somewhat sticky when damp. Flesh is white or lemon-yellow. Where cut, it becomes faintly blue. Stem is a pallid cap color with fine cottony fibrils; it is fairly stout, more or less equal. Ring is absent.\n\nSimilar species Boletus edulis has a barrel-shaped stem with white net patterning.\n", "Boletus edulis": "Dimensions Cap 8–20(30) cm; stem 6-8 cm tall * 2-4 cm diameter Description A large, robust bolete with dull brown cap, dirty white pores and stout and swollen stem. White net over upper stem.\n\nCap Dull cigar- or bay-brown; convex or bun-shaped, at first with a whitish bloom, becoming smooth and dry. Flesh white, unchanged when cut or bruised. Pores white or cream colored, discoloring dirty yellowish grey. Tubes white at first, slowly becoming greyish yellow to olive-brown. Stem pallid cap-color background, covered with a white network, stout and bulbous. Ring absent. Interior solid.\n\nSimilar species Boletus variipes has a dry, tan cap and grows with oak; Tylopilus felleus is similar when young but tastes bitter.", "Boletus pinophilus": "Dimensions Cap 6–15(20) cm; stem 5-15 cm tall * 4-7 cm diameter Description Large bolete with dark brown cap, cream pores, reddish brown netted, bulbous stem. Grows solitary or scattered on soil specifically with Scots Pine.\n\nCap Dark brown with reddish tinge; convex or bun-shaped, becoming expanded with age, dull, sometimes slightly wrinkled. Flesh white, tinged cap color beneath the cuticle, unchanging, thick, fairly firm. Pores white then cream, becoming olivaceous-brown with age, circular and small. Spores pallid olivaceous-yellow colored. Stem Pallid, with fine reddish brown dots arranged into a network which is whitish at apex, stout, bulbous. Ring absent. Flesh white, unchanging and fairly firm.\n\nSimilar species Boletus edulis has brown color and grows with Pine; Tylopilus felleus is similar when young but tastes bitter.", "Boletus subtomentosus": "Dimensions Cap 5-12 cm diameter, stem 3-8 cm tall * 1-2 cm diameter Description This medium to large bolete has a brown cap, chrome-yellow pores, and yellowish stem.\nCap is a tawny brown; convex or bun-shaped, it is at first downy, becoming smooth and sometimes cracking. Flesh is white or pallid yellow, with a faint brownish zone beneath the cap cuticle; it is unchanging, thick and soft. Stem is a pallid cap color, sometimes with a brick-red tinge; it is slender and slightly bulbous. Ring is absent. Flesh is similarly colored as thecap but browner.\n\nSimilar species Boletus chrysenteron has a reddish brown cap that cracks to reveal a red underlayer. Boletus pruinatus is smaller.\n"}{"Bovista plumbea": "Dimensions 2-3 cm diameter * 2-3 cm tall Description This small, white, rounded structure is attached to the stony surface by several strands. It grows solitary or in scattered troops on lawns, in short grass and pastures.\n\nFruiting body is coated white. It is smooth, falling away in flakes at maturity to reveal dark grey papery contents. Sub-spherical in shape, it is slightly pointed below with the fertile head merging abruptly into a cluster of mycelial strands which may rupture allowing the fruiting body to roll around in the wind. Spore mass is at first white and firm, becoming clay-brown and finally olive-brown and powdery. Spores are olive to sepia-brown.\n\nSimilar species the inner covering layer of Bovista pila is dark brown to bronze.\n", "Calvatia excipuliformis": "Dimensions 3-10 cm diameter * 8-20 cm tall Description This pale buff or brown, pestle-shaped fungus occurs solitary most often, however it sometimes is found in small troops on soil in pastures and woodlands.\n\nFruiting body Covered with short spines and warts, the body falls away pallid buff becoming dull brown. When mature, the outer skin breaks open and brown spores are dispersed by wind and rain. When young and firm, the fruit-bodies are fairly tasteless yet edible.\n\nSimilar species Calvatia elata is widespread and common in North America. Lycoperdon molle resembles a short-stemmed specimen.\n\nSynonyms Handkea excipuliformis", "Cantharellula umbonata": "Dimensions cap 2-3 cm dia; stem 2.5-12.5 cm tall * 0.3-0.7 cm dia. Description Small to medium-sized, funnel-shaped, grey cap bearing forked gills.\n\nCap typically 2-3 cm wide, occasionally becoming almost; 7.3 cm wide; convex at first, becoming flat to sunken; most specimens with a small, pointed umbo; margin incurved at first, becoming upturned and wavy in age; surface gray to grayish brown overall, often appearing to have whitish blotches; dry to moist; smooth to minutely hairy; flesh white; odor and taste not distinctive. Gills close to crowded, decurrent, repeatedly and regularly forked; whitish, developing spot-like reddish or sometimes yellow stains in age. Stem 2.5-12.5 cm long, 3-7 mm thick often with swollen portions; some-what flexible, often bent, curved, and/or twisted; white to gray; silky above, stuffed, usually with whitish mycelium binding the lower stalk to mass; often water-saturated near the base. Spore print white.\n\nSimilar species Cantharellus tubaeformis dingy-brown cap bearing forked veins instead of gills.", "Cantharellus cibarius": "Dimensions Cap 3-10 cm across, stem 2-10 cm tall * 0.4-1.5 cm thick Description Egg-yellow, shallowly funnel-shaped fruiting body with gills replaced by forked ridges. Varies in color, but often yellow with a hint of red. \nCap depressed in the center and often has a heavy margin; it has thick, decurrently, forked, gill-like veins. Margin of cap often wavy and intended. Color is egg-yellow, fading with age. Flesh firm, thick, yellow. Stem solid, tapers downward from cap. The surface is smooth and colored like the cap or lighter.\n \n\nSimilar spiecies Hygrophoropsis aurantiaca is not mycorrhizal. Omphalotus olearius has a luminous quality and grows on dead wood.", "Cantharellus tubaeformis": "Dimensions cap 1.5-6 cm dia; stem 3-8 cm tall * 0.4-0.9 cm dia. Description Small to medium-sized, funnel-shaped, dingy-brown cap bearing forked veins instead of gills, yellowish stem.\n\nCap dark grayish brown, at first convex with depressed center, becoming moderately incurved with wavy irregular margin, smooth or slightly scaly. Gills absent - lower surface bearing shallow forked ridges, yellowish, becoming more gray with age. Stem  yellowish, more or less equal but often flattened, hollow. Flesh thin and membranous. \n\nSimilar species Cantharellus lutescens lacks veins under cap.", "Clitocybe gibba": "Dimensions Cap 3-8 cm diameter, stem 3-8 cm tall * 0.5-1 cm thick Description This medium-sized agaric has a pale buff, funnel-shaped cap and whitish gills that are extending downward. It grows solitary or in small troops on soil in broad-leaf woods and on heaths.\n\nCap is pallid pinkish buff, sometimes with an ochre tinge. It is smooth, silky, and funnel-shaped, typically with a wavy margin. Flesh is whitish buff, thick and soft. Gills are white, tinged buff, crowded, narrow and deeply extended downward. Spores are white-cream colorcolored. Stem is similarly colorcolored as the cap. It is smooth and more or less equal apart from a slightly swollen base. Ring is absent. Flesh is white, tinged buff, tougher than in cap, partly stuffed or hollow.\n\nSimilar species Lepista flaccida and Lepista gilva which is more fleshy and paler with a spotted cap margin.\n", "Clitopilus prunulus": "Dimensions 2-3 cm diameter * 2-3 cm tall Description A pale gray-white cap and decurrent, pale pink gills, combined with a strong smell of fresh bread dough, distinguish this species. \n\nCap The cap is convex to funnel-shaped. Stem is central or off-center and is similar in color to the cap.\n\nSimilar species Species of Clitocybe and Entoloma can look very similar and are poisonous.", "Coprinus comatus": "Dimensions Cap 5-15 cm tall * variable diameter, stem 10-30 cm tall * 1.5-2.5 cm thick Description This agaric has a white, conical, shaggy cap which blackens. It grows in scattered trooping groups on soil in short grass.\n\nCapis  white; it is at first ovoid-cylindrical, pressed to the stalk at the margin, becoming conical. It is decorated with feathery, overlapping, partly reflexed velar remnants, white when young or stained brownish. Flesh is white, soon discoloring. It is fleshy in relation to cap size, fragile, and auto-digesting. Gills are white at first, rapidly becoming pinkish, grey-brown and finally black. They are free and crowded. Spores are black. Stem is white, smooth, often very tall, slightly swollen at base and sometimes rooting. Ring is white, thin, loose and often slipping down stem towards base. Flesh is white, medium, hollow and fragile.\n"}{"Cystoderma amianthinum": "Dimensions Cap 2-5 cm diameter, stem 3-5 cm tall * 0.4-0.8 cm thick Description Small to medium, fleshy agaric with ochre-yellow cap, white or cream gills, and coarsely granular stem with ring. Grows solitary or scattered in small tufted groups on soil amongst short grass in coniferous woods and on heaths.\n\nCap ochraceous or yellowish tan; at first campanulate, becoming expanded-convex or flattened, radially wavy with age, granular. Flesh pallid yellow and thin. Gills white, becoming creamy-yellow, adnate, crowded. Stem same color as cap, more or less equal, smooth above ring, coarsely granular below. The ring has same color as stem or slightly darker tan, upwardly directed and persistent. Flesh dirty yellow, firm and stuffed.\n", "Gomphidius glutinosus": "Dimensions Cap 3-5 cm diameter, stem 2.5-4.5 cm tall * 0.4-1 cm thick Description This gray-brown agaric is covered in a colorless, slimy veil. The stem has an indistinct ring zone, often stained black by spores, and its base is lemon-yellow. Mycorrhizal with spruse.\n\nCap gray-brown, convex or bun shaped, becoming expanded and flattened, heavily viscid when damp, becoming shiny when dry. Flesh dirty white, moderate and firm. Gills at first whitish, becoming tinged olivaceous-grey when mature, deeply decurrent, thick. Stem dirty white, more or less equal, lemon yellow at base. Ring white, glutinous, zone-like.   ", "Hydnum repandum": "Dimensions Cap 3-10 cm diameter; stem 2-6 cm tall * 1.5-3 cm diameter Description Medium-sized to large, fleshy cap; pale whitish to pale orange-yellow. Grows on soil in broad-leaf or coniferous woods.\n\nFruiting body cream, sometimes with yellowish tinge, cap smooth or faintly downy, at first convex with inrolled margin flattened, margin remaining incurved. Flesh thick, soft, brittle, white, stains brownish orange where bruised. Odor not distinctive. Spines are off-white to pinkish; decurrent and small often extending from lower cap down upper stem Stem Thick, central of off center; colored like cap or lighter.\n\nSimilar species\nHydnum albidum has a white cap, smaller spores, and occurs on alkaline soil. Closely related Hydnum refescens is smaller and orange.", "Hydnum rufescens": "Dimensions Cap 2-6 cm diameter, stem 1.5-4 cm diameter * 0.8-1.5 cm tall Description This small or medium-sized fruiting body is similar to that of Hydnum repandum but salmon pink colored. It grows on soil in broad-leaf or coniferous woods.\n\nFruiting body is salmon-pink. Cap is smooth or faintly downy; it is at first convex with inrolled margin, becoming flattened and often slightly funnel-shaped. Margin remains incurved. Stem is stout, more or less equal, sometimes eccentric, and finely downy. Flesh is pinkish, soft, thick and rather crumbly. Spines are salmon pink and broadly attached to the stem. Spores are glassy in color.\n\nSimilar species Hydnum repandum.\n", "Hygrophorus camarophyllus": "Dimensions Cap 2-7 cm diameter, stem 2.5 - 13 cm tall * 1 - 2 cm thick Description Medium-sized agaric with thick, sparse, white gills that contrast beautifully with the carbon-brown cap and stem.\n\nCap umbonate and often with a raised boss in center of cap, carbon-brown to gray-black with dark radial streaks. Gills decurrent, sparse, waxy, first white, with age white-gray. Stem top often brighter than other stem but not always, otherwise greyish with ingrown threads. Flesh white, brittle, with mild flavor and pleasant aroma. \n Grows in mossy pine forests all over Scandinavia. Has a fairly modest taste but still a delicacy. ", "Hygrophorus hypothejus": "Dimensions Cap 3-7 cm diameter, stem 4-7 cm tall * 0.7-1.4 cm thick Description This smallish, slimy agaric has a dull brown cap and distinctive yellowish gills and stem. It grows in trooping groups on soil in pine woods from late autumn to winter.\n\nCap is sticky, dull olive-brown and slightly more pallid at the margin; it is at first convex, becoming more flattened and sometimes slightly depressed. Flesh is thin and pallid yellow, bruising more orange. Gills are pallid yellow but darken with age. They are broad and fairly distant extending downward. Spores are white. Stem is pallid yellow, sometimes tinged with orange, more or less equal or tapering slightly downwards. It is sticky below the ring zone. Ring is absent but stuffed and superior ring-like from swelling.\n\nSimilar species Hygrophorus locorum is bright yellow and associated with larch. Several other Hygrophorus species, found with pine, are distinguished from Hygrophorus hypothejus by their different coloring.\n", "Kuehneromyces mutabilis": "Dimensions Cap 3-6 cm diameter, stem 3-8 cm tall * 0.5-1 cm thick Description This medium-sized agaric has a bright tan cap, drying paler from the centre. It also has yellowish or reddish brown gills and a ring on the stem. It grows on stumps and logs of broad-leaf trees, favorfavoring birch.\n\nCap is tan when damp, drying pallid ochre, distinctively two-tone from centre; it is convex, becoming flattened with a blunt umbo. It is smooth, not greasy or sticky. Flesh is a pallid cap color and thin. Gills are pallid ochre, becoming cinnamon at maturity; they are broadly attached to the stem and crowded. Spores are ochre-brown. Stem is pallid tan above ring, darker tan below, and shading to almost black at base. It is slender, scaly, more or less equal, and smooth. Ring is brown, torn, and sub-apical. Flesh is stuffed.\n\nSimilar species A group of poisonous Galerina species are similar. Galerina are unicolor and Galerina marginata have fibers and no stem scales.\n", "Laccaria laccata": "Dimensions Cap 1.5-6 cm diameter, stem 5-10 cm tall * 0.6-1 cm thick Description Smallish agaric, tawny (damp) or pale yellowish (dry) throughout, with distant thickish gills and fibrous stem. Grows in scattered trooping groups on soil in mixed woods and on heaths.\n\nCap tawny or brick red, drying pallid ochraceous; at first convex, becoming flattened and finally depressed with wavy margin, smooth or slightly scurfy at the centre in older specimens. Flesh has same color as cap surface. Gills colored as cap or with pinkish tinge, but becoming powdered white with spores, adnate, thick, broad distant. Stem colored as cap, farinose neear the apex, otherwise covered in whitish fibres and white woolly base, often twisted and laterally compressed. Ring absent. Flesh colored as surface, fibrous, tough, at first dull, then hollow.\n\nSimilar species Laccaria bicolor has contrasting, pale blue gills. Laccaria proxima is larger with more fibrillose stem. Laccaria ochropurpurea is much larger and has purple gills."}{"Lactarius deliciosus": "Dimensions Cap 3-10 cm diameter, stem 3-6 cm tall * 1.5 - 2 cm diameter Description Fairly large, buff agaric with distinctive salmon -pink blotches, pale carrot colour gills and exuding carroty milk; solitary or in scattered groups on soil under conifers, favouring pine trees.\nCap pallid buff, sometimes with faint greenish tinge and with concentric salmon -pink blotches; at first convex with inrolled margin, becoming depressed, slightly sticky. Flesh pallid yellowish sometimes stained carrot, ageing dull greyish green, thick, firm and\nbrittle. Gills at first apricot or saffron, becoming carrot, dull green on bruising, slightly decurrent, narrow, close. Stem concolorous with cap, more or less equal, smooth, stout. Ring absent. Flesh pallid yellowish, reacting as in cap, stuffed, becoming hollow.\n\nSimilar species Lactarius deterrimus found with spruce trees has a smooth stem and exudes green staining orange milk.", "Lactarius deterrimus": "Dimensions Cap 3-10 cm diameter, stem 3-6 cm tall * 1.5 - 2 cm diameter Description This large, buff agaric has distinct salmon-pink blotches, pale carrot gills and carroty milk.  It grows by itself or in groups scattered throughout soil under conifers, particularly pine and spruce trees.\nCap is a pale buff color with a greenish tinge and concentric salmon-pink blotches.  It is convex to shield shape with a slightly sticky inrolled margin, becoming depressed. The flesh is a yellowish, sometimes a stained carrot color but the whole fungus is likely to age dull grayish green, thick, firm and brittle. Gills are apricot or saffron at first, becoming carrot, and dull green on bruising, slightly extending downward. Stem is similar in color similarly colored as thecap, more or less equal, smooth and stout. Ring is absent. Flesh pallid yellowish, reacting as in cap, is stuffed and never hollow.\n", "Lactarius rufus": "Dimensions Cap 3-10 cm diameter, stem 4-8 cm tall * 0.5-2 cm thick Description This small to medium-sized agaric has a dull reddish brown cap, pale flesh-colorcolored gills and exudes milk.\n\nCap is reddish or bay-brown; it is at first convex with inrolled margin, later flattened or slightly depressed typically with a small central umbo, matte when dry. Flesh is whitish and fairly thick, granular and brittle. Gills are at first pallid yellowish, then more similarly colored as the cap, more or less extending downward, narrow, and fairly crowded. Spores are off white. Stem is similarly colored as the cap or more pallid, more or less equal, and smooth. Ring is absent.\n\nSimilar species Lactarus hepaticus exudes white milk that stains yellow as it dries.\n", "Lactarius torminosus": "Dimensions Cap 4-12 cm diameter, stem 4-8 cm tall * 1-2 cm thick Description This largish, salmon-pink, distinctively woolly agaric exudes milk.\n \nCap is buff with a pinkish or salmon tinge with darker concentric zones; it is convex, later depressed or funnel shaped, with margin inrolled. It is woolly or hairy and matted. Flesh is white, thick, granular and brittle.\nGills are pallid buff or salmon, extending downward, narrow, and crowded. Spores are pale yellowish cream. Stem is similarly colored as the cap but more pallid. It is more or less equal or tapering at both ends, at first finely downy, then smooth or slightly pitted. Ring is absent. \n \nSimilar species Lactarius pubescens is paler with fainter zones.  It has a less shaggy cap. Lactarius scoticus is smaller and also pale.\n", "Lactarius trivialis": "Dimensions Cap 6-15 cm diameter, stem 6-12 cm tall * 1-2 cm thick Description This largish agaric has a violet cap and pale gills and stem. Exuding milk, it grows solitary or in scattered groups on boggy soil under coniferous trees and birches.\n\nCap is at first purplish violet with darker zones, becoming brownish gray or pinkish beige. The cap is convex, becoming later barely depressed. It is also greasy or sticky when damp. Flesh is whitish, thick, and brittle. Gills are pallid and grayish green where damaged. Narrow and crowded, they are broadly attached to the stem or barely extending downward. Spores are pale yellow. Stem is greasy when damp, hollow and more or less equal. It is pallid with violet or hazel tinges. Ring is absent.\n\nSimilar species Lactarius argillaceflius grows in eastern North America under oaks with gills that stain and age brownish.\n", "Lactarius volemus": "Dimensions Cap 5-11 cm diameter, stem 4-12 cm tall * 1-3 cm diameter Description This very fleshy, matte orange species has a thin, cracking skin on its cap and a thick, velvety pale orange stem. When cut, its off-white, mild tasting flesh produces white milk.\nCap is tawny-brown with an apricot tinge; convex with a depression and incurved margin, the smooth, slightly downy flesh is whitish, firm and brittle.\nGills, uniform in color with the cap but more pallid, grow along the margin. They are broadly attached to the stem slightly extending downward, narrow, and fairly crowded.  Stem is  similarly colored as the cap but also more pallid. It is also smooth or faintly downy. Ring absent.\n\nSimilar species Lactarius hygrophoroides is a good edible lacking the odor. It is equally common in eastern North America. It does not stain and has distant gills.\n", "Leccinum scabrum": "Dimensions Cap 5-15 cm diameter, stem 6-15 cm tall * 1.5-3 cm diameter Description Medium to large bolete with brown cap, dirty white spores and scaly stem. Grows specifically with birch, often on damp gound.\n\nCap brown, with reddish or grayish tinges; convex or bun-shaped, at first finely downy, becoming smooth, somewhat scurfy when older. Flesh dirty white, unchanging, thick and firm. Pores dirty white or grayish brown, circular, small. Tubes concolorous with pores, adnate. Spores are ocher-brown. Stem whitish, covered with gray-brown scales, more or less equal or tapering slightly upwards. Ring absent. \n\nSimilar species Distinguishing between Leccinum scabrum and its near relatives is difficult, and Leccinum scabrum is often used as a collective name for all brown capped Leccinum species like Leccinum variicolor.", "Leccinum versipelle": "Dimensions Cap 8-20 cm diameter, stem 8-20 cm tall * 1.5-4 cm thick Description This large or massive bolete has a distinctive orange cap, grayish yellow pores and a scaly stem; it grows solitary or in small scattered groups on soil specifically under birch trees and on heaths.\n\nCap is tawny-orange; it is convex or bun-shaped. At first it is slightly downy, then smooth and sometimes slightly sticky. The cuticle overhangs the cap margin. Flesh is white, becoming dark where cut, thick and firm. Pores are circular and small. They are at first whitish, then buff, darkening rust where bruised. Tubes are similarly colored as the pores, wine colored where cut, and depressed. Spores are ocher-brown. Stem has a pallid whitish background, covered with brown or brownish black woolly scales. It is stout, more or less equal or club-shaped. Ring is absent. Flesh is white turning black where cut.\n"}{"Lepista nuda": "Dimensions Cap 6-12 cm diameter, stem 5-9 cm tall * 1.5-2.5 cm thick Description Medium-sized, fleshy agaric, with brownish cap and lilac gills. Grows in trooping groups, often in rings, on soil in mixed woods, hedgerows, parks and gardens.\n\nCap at first lilaceous, becoming brownish and drying more pallid; at first convex and slightly umbonate, becoming flattened and finally shallowly depressed and wavy, smooth. Flesh bluish lilac and thick. Gills lilaceous, fading to buff or brownish with age, emarginate, fairly narrow and crowded. Spores are pink. Stem colored as cap, more or less equal, fibrillose and often slightly thickened at the base. Ring absent. Flesh bluish lilac, thick, firm, full.\n\nSimilar species Unrelated poisonous look-alikes include species of Entoloma, Cortinarius and Hebeloma.", "Lycoperdon perlatum": "Dimensions 2.5-6 cm diameter * 2-9 cm tall Description Rounded, typically with a distinct stem, this white to yellowish brown species is covered with short spines, each surrounded by smaller, grainlike scales. Grows typically in troops on soil in mixed woodland.\n\nFruiting body white, becoming ochre-brown, covered with short pyramidial warts which fall off to reveal endoperidium decorated with a reticulate patter; sub-spherical opening by an apical pore, the fertile head tapering down into a distinct, sterile, basal region. Spore mass at first white and firm, becoming olive-brown and powdery. Spores are pale yellow to olive-brown. \n\nSimilar species Lycoperdon nigrescens has longer, darker spines in groups, like those of the much longer-spined Lycoperdon echinatum. The surface of both has a similar pattern when the spines fall off.\n", "Lycoperdon pyriforme": "Dimensions 1.5-4 cm diameter, 1-5 cm tall Description Smallish, white or grey-brown, pear-shaped structure on a pedestal. Grows typically in troops on rotten wood or stumps, sometimes submerged so that the fruiting bodies appear to be growing on soil.\n\nFruiting body exoperidium of short spines, granules or warts, white, becoming grey-brown which falls away to reveal whitish, smooth, inner peridium opening by an apical pore; the fertile head tapering down into a distinct, spongy, sterile, basal region. Spore mass at first white and firm, becoming olive-brown and powdery. Spores are olive-brown.\n\nSimilar species Found in open, wooded areas, Lycoperdon lividium is also smooth, but is grayer and has warty spores (those of Lycoperdon pyriforme are almost smooth).\n", "Macrolepiota  rachodes": "Dimensions Cap 5-15 cm diameter; stem 10-15 cm tall * 1-1.5 cm diameter Description A large, fleshy agaric with shaggy, pale grey-brown cap and whitish gem with ring and obliquely bulbous base; solitary or scattered on in woods generally, often with conifers.\nCap is pallid buff or grey-brown, decorated with darkish brown, Dread, slightly reflexed, fibrous shaggy scales; at first bun-shaped, becoming broadly umbonate or flattened. Flesh soft, thin, flushing :armine red where cut. Gills are white, bruising reddish, free (remote), crowded. Stem is whitish, tinged pinkish brown, tapering slightly upwards, base slightly bulbous, eccentric. Ring colored as stem, spreading, double, felty, superior, movable. Flesh white, flushing carmine red where cut, firm and hollow. Odour strong, aromatic. Taste not distinctive.\nSimilar species Macrolepiota permixta and Macrolepiota procera are lager, with snakeskin-patterned stems.\n", "Macrolepiota procera": "Dimensions Cap 10-25 cm diameter; stem 15-30 cm tall * 1-1.5 cm diameter Description A large, distinctive, pale brownish agaric, it has a scaly cap, white gills, and a pale brownish stem with ring; it grows solitary, scattered or clustered on soil in open grassy places and in mixed woods.\nCap is pallid brown decorated with darker brown broad scales; at first spherical or ovoid, it becomes expanded in convex shape and finally flattens with a slight broad umbo. Flesh is white, soft and thin. Gills are white, free, and crowded. Stem is distinctive grey-brown with banded markings on a whitish background, woody, swelling at the base. Ring is white above and brown below.\nSimilar species The poisonous Chlorophyllum molybdites has a stouter stalk and a green spore print. \n", "Marasmius oreades": "Dimensions Cap 2-5 cm diameter, stem 2-10 cm tall * 0.3-0.5 cm thick Description Producing characteristic rings in turf. This mushroom has a bell-shaped to convex cap, which becomes flatter with a broad umbo with age.\n\nCap tan, hygrophanous, drying to buff but retaining tan tinge at centre; at first convex, then flattened and broadly umbonate, smooth but striate  at the margin. Flesh whitish buff, thick at the center, otherwise thin. Gills whitish, becoming ochraceous-cream, adnexed or free, fairly broad and distant. Spores off-white. Stem concolorous with cap, smooth or finely scurfy, slender, more or less equal, whitish downy at the base and slightly rooting, stiff. Ring absent.\n\nSimilar species The poisonous Clitocybe dealbata is found in the same grassy habitat. It is distinguished by its decurrent gills. Can also be mixed up with the poisonous Clitocybe rivulosa.\n", "Melanoleuca cognata": "Dimensions Cap 4-10 cm diameter, stem 5-12 cm tall * 1-1.5 cm thick Description Medium or large agaric, with pale brown, broad, umbonate cap and white gills. Grows solitary or scattered on soil in coniferous woods.\n\nCap ochraceous-brown, drying more greyish brown; at first flattened convex, becoming umbonate-depressed, smooth, shiny. Gills cream, emarginate, broad, crowded. Spores cream colored. Stem pallid with brownish fibrils, tapering slightly upwards from more or less bulbous base. Ring absent. Flesh cream, soft and full.\n", "Morchella elata": "Dimensions 2-4 cm diameter * 5-15 cm tall Description This morel has a conical cap with distinct black ridges and brown to smoky-grey pits. The stem is white with a rough, mealy or granular surface and hollow center.\nFruiting body is yellowish brown, with darker parallel longitudinal ribs that are connected to form honeycomb-like pits; while conical, it tapers downward into a creamy-white stem, more or less equal. Flesh is white, brittle, thin and hollow.\n\nSimilar species Morchella esculenta is yellow with pale ribs along the length of its cap. Gyromitra species, which are poisonous, lack the pitted cap. It has a chambered, rather than hollow, stem.\n"}{"Polyporus squamosus": "Dimensions Cap 10-60 cm diameter, 0.5-5 cm thick Description Large, creamy—brown scaly cap with cream pore-bearing under surface, annual; parasitic on broad-leaf trees, also on stumps, favouring beech, elm and sycamore. \nFruiting body upper surface cream with more or less concentric bands of cinnamon, fibrillose scales, fan-shaped or semi circular, more or less flattened, regular margin; stem darkening towards the base, lateral or, less commonly, eccentric, short. Flesh whitish,\nthick and leathery. Pores whitish cream. Tubes whitish, becoming cream, decurrent, 5—10mm deep. Taste not distinctive.", "Rozites caperatus": "Dimensions Cap 5-12 cm diameter, stem 4-10 cm tall * 1-1.5 cm thick Description Egg-shaped on emerging, the cap of this species becomes convex to umbonate with age. It is yellow-brown with a wrinkled surface and remnants of the white to lilac veil in the center. The smooth stem has a narrow, sheathing ring.\n\nCap ochraceous, tinged brown, covered with fine silky fibrous velar remnants; at first convex, becoming expanded or umbonate. Flesh whitish, tinged ochraceous or buff, moderate. Gills pallid buff or clay, adnate, crowded. Spores are pale brown. Stem whitish, fibrous, more or less equal or slightly swollen at base. Ring whitish, narrow and superior.\n\nSimilar species Cortinarius species are related, but have no true stem rings and have rust-brown spores.\n", "Russula aeruginea": "Dimensions Cap 4-9 cm diameter, stem 4-8 cm tall * 0.7-2 cm thick Description This species has a convex to depressed green cap that is often marked with rust- to red-brown spots and frequently has furrows at the margin. It grows solitary or in scattered groups on soil under birch.\n\nCap pallid grass-green with yellowish or brownish tinges or more rusty spotting, darker at centre; at first convex, later flattened and slightly depressed, smooth with slight radial veining, margin slightly depressed, smooth or with slight radial veining, margin is sulcate. Flesh white, moderately thick, granular and brittle. Gills buff, becoming yellowish tinged, adnexed, forked, fairly narrow and crowded. Stem white, sometimes with rust spotting, more or less equal, smooth. Ring absent. Flesh white, fairly firm but brittle and full. Spores are cream colored.\n\nSimilar species Russula heterophylla has former flesh. The cap of Russula virescens has small scales. Both are mild tasting. Be careful so you don't mix with the deadly poisonous Amanita phalloides with has a ring and is not a Russula.", "Russula claroflava": "Dimensions Cap 4-10 cm diameter, stem 4-10 cm tall * 1-2 cm thick Description This largish agaric has a bright yellow cap, brittle yellow gills and white stem.\n\nCap is bright or ochre-yellow, discoloring gray with age; it is at first convex, later flattened and slightly depressed. It is smooth, slightly sticky when damp. Margin is finely sulcate in older specimens, cuticle peeling halfway to centre. Flesh is white, moderately thick, granular, soft, and slowly graying where damaged.  Gills are pallid ochre, fuming gray where damaged, more or less free or reaching but not connected to the stem, forked, and fairly crowded. Stem is white, reacting as in cap, more or less equal, fairly stout, and smooth. Ring is absent.\n\nSimilar species Russula claroflava has a stem that grays strongly on bruising. Russula ochroleuca has a green tinge on the cap. Russlula ochroleucoides is a bitter-tasting American equivalent, growing in East Coast oak woods.\n", "Russula decolorans": "Dimensions Cap 4.5-11 cm diameter, stem 4.5-10 cm tall * 1-2.5 cm thick Description This medium to large agaric has a distinctively colored orange-brown cap, pale yellow gills and white stem, all parts graying or blackening.\n\nCap is reddish, orange-brown, or tawny, blackening; it is at first sub-spherical, then flattened-convex with incurved margin, later somewhat depressed. It is smooth or slightly sticky, cuticle peeling only at margin. Flesh is white, graying rapidly when damaged or cut, moderately thick, fleshy and firm.\nGills are pallid ochre, blackening in cap, reaching but not attached to the stem, strongly interveined, narrow, and close. Stem is white, graying readily when bruised or with age, more or less equal or somewhat club-shaped, stout, and smooth. Ring is absent.\n", "Russula obscura": "Dimensions Cap 5-14 cm diameter, stem 6-12 cm tall * 1-3 cm thick Description This medium sized agaric has a purplish red or wine colored cap, straw-colorcolored gills and stem flushed grayish rose, blackening where bruised.\n\nCap is purplish red or wine colored with a slightly more pallid margin; it is at first convex, becoming flattened or somewhat depressed. Margin is faintly sulcate when old, otherwise it is smooth, cuticle peeling to two-thirds. Flesh is white, blackening where damaged, thick and brittle. Gills are slightly curved and reach towards the stem but are not attached; they are straw colored, narrow and interveined. Stem is white but often tinged rose or grayish, blackening where bruised, somewhat clup-shaped. \n", "Russula paludosa": "Dimensions Cap 5-14 cm diameter, stem 5-14 cm tall * 1-3 cm thick Description Taller than most, this large, attractive Russula species has a convex to depressed, orange-red cap, with yellow discoloration in the center and a slightly sticky surface when damp.\n\nCap variable, reddish with apricot, bay, blood or scarlet tinges; at first convex, later flattened and depressed, shiny or somewhat sticky when damp, cuticle peeling halfway to center.  Flesh white, moderate, granular and brittle. Gills cream or pallid ochraceous, adnexed, brittle, narrow, strongly interveined. Spores pale ocher. Stem white or tinged pink, more or less equal or tapering slightly upwards, smooth. Ring absent. Flesh white, fragile and stuffed.\n\nSimilar species The poisonous and hot-tasting Russula emetica has no yellow coloring on the cap.\n", "Sarcodon squamosus": "Dimensions Cap 10-25 cm diameter, stem 4-7 cm tall * 2-4 cm thick Description Large, coarsely scaly, gray cap with dark grayish, spiny under-surface. Grows with pines solitary or in scattered groups, on soil in coniferous woods.\n\nFruiting body cap grayish, decorated with coarse darker gray scales, erect at the centre, more flattened towards the incurved margin, arranged in concentric rows; at first shallowly convex, then flattened or slightly depressed at the centre; at first whitish, becoming gray, remaining pallid at the base, equal or somewhat clavate towards the base, downy. Flesh white, thick in the cap centre, firm, full in stem. Spines at first white or pallid, then gray with purplish brown tinge, decurrent."}{"Suillus bovinus": "Dimensions Cap 3-10 cm diameter, stem 4-6 cm tall * 0.5-1 cm thick Description This usually small, orange-rusty brown bolete, with it's convex to flat cap and short, ringless stem, is notable for it's compound pores: the olive-green pore layer has an outer layer of coarse; angular pores and an inner layer of fine pores.\n\nCap ochraceous or pinkish clay, more pallid at margin; convex or bun-shaped, smooth, sticky or viscid when damp. Flesh white with pinkish clay tinge, thick and soft. Pores at first pallid olive or buff, becoming more ochraceous with age, angular, compound, unequal, large. Tubes grayish with vinaceous tinge, more or less decurrent. Spores brownish olive. Stem pallid yellowish sienna, more or less equal or tapering at base. Ring absent.", "Suillus grevillei": "Dimensions Cap 3-10 cm diameter, stem 5-7 cm tall * 1.5-2 cm diameter Description This vividly colored bolete grows with larch trees in woods. The mushroom is slimy, with yellow cap, small pores and whitish ring on stem.\n\nCap chrome-yellow, rust with age; convex or bun-shaped, smooth, shiny and sometimes wrinkled when dry, sticky or viscid when damp. Flesh pallid lemon-yellow, unchanging, moderate, soft. Pores at first pallid lemon-yellow, becoming more ochraceous and tinged rust where bruised, angular, small. Tubes pallid yellow and slightly decurrent. Spores Yellowish brown. Stem concolorous with cap, tinged more rust below, slightly woolly or granular, slender, more or less equal or slightly swollen at base. Ring pallid whitish, superior, pointing upwards.", "Suillus luteus": "Dimensions Cap 5-10 cm diameter, stem 5-10 cm tall * 2-3 cm thick Description Medium to large bolete with slimy, brown cap. Short to stubby stalk has brown dots and a well-developed ring.\nCap Rounded to nearly flat. Chestnut or sepia-brown, smooth, shiny and somewhat wrinkled when dry, very glutinous when damp, margin sometimes retaining velar remnants. Flesh whitish with yellow tinge, unchanging, moderate and soft, unchanging when cut. Pores at first pallid lemon-yellow or straw, becoming more dirty yellow or sienna-brown with age, circular, medium. Tubes concolorous with pores, adnate. Spores Ocher-brown. Stem Cylindrical or tapered downwards; solid. Yellow and dotted above ring; whitish below, especially at base. Ring at first whitish, darkening with age, vinaceous-brown below and large.", "Suillus variegatus": "Dimensions Cap 6-13 cm diameter, stem 5-9 cm tall * 1.5-2 cm thick Description Tall-stemmed and fleshy, the Suillus variegatus rarely exhibits the slimminess that is characteristic of the genus suillus.\n\nCap ochraceous or olivaceous-brown; convex or bun-shaped, at first slightly downy, becoming more greasy or sticky with age, with small, darker brown, adpressed scales. Flesh pallid ochraceous, unchanging or occasionally with blue tinge, moderate and soft. Pores at first ochraceous with olivaceous tinge, becoming more cinnamon-brown with age, sometimes bluish where bruised. Tubes dark ochraceous or buff, adnate. Stem pallid ochraceous, more lemon-yellow towards apex, more rust below, more or less equal or tapering slightly upwards. Ring absent.\n\nSimilar species Suillus tomentosus is the equivalent species in western North America."}{"Albatrellus confluens": "Dimensions Cap 7-18 cm diameter, stem 3-7 cm tall * 1-3 cm thick Description From above, this pale orange polypore looks like an agaric or a hedgehog mushrooom, but it has minute pores on the underside. The skin of the convex cap often cracks with age. It has a sturdy stem and very firm, mild to slightly bitter white flesh. Grows under conifers, mycorrhizal with conifers in a wide variety of ecosystems.\n\nSimilar species Albatrellus ovinus is more cream white and does stain yellow or greenish yellow, particularly on the pores.\n", "Amanita ceciliae": "Dimensions Cap 7-12 cm diameter, stem 8-13 cm tall * 1.5-2 cm diameter Description This large, grayish brown, fleshy agaric has a scaly stem, white gills, and no ring or volval bag.\n\nCap is pallid gray-brown; it is convex becoming more expanded and then narrowed at the margin.  Large, coarse, dingy gray patches decorate the volva. Flesh is white and firm. Gills are white, free, and crowded. Stem is pallid, grayish brown with white shaggy horizontal bands of veil; an inconspicuous bulb is encased in a volval bag breaking away leaving slanting ridges. Ring is absent.\n", "Amanita fulva": "Dimensions Cap 4-9 cm diameter, stem 7-12 cm tall * 0.8-1.2 cm diameter Description Medium-sized agaric , distinctive tawny cap and white gills, no ring, usually without cap patches but with volval bag; solitary or scattered on soil in mixed woodlands, favouring birch. Not recommended to be eaten because of danger to be mistaken with poisonous members of the Amanita genus. \n\nCap tan or orange-brown with sulcate margin, occasionally with brownish velar patches, at first ovoid, becoming expanded-convex and flattened with a slight umbo. Flesh white and brittle.\nStem whitish or pallid cap coulor, narrower towards the apex and arising from white volval bag. Ring absent. Hollow in marture specimens. \n\nSimilar species Amanita crocea and Amanita vaginata.", "Auriscalpium vulgare": "Dimensions Cap 1-2 cm diameter; stem 2-6 cm tall * 0.1-0.2 cm diameter Description Small long medium, brown cap, attached at one side or off center. Long, slender, stalk rises from decaying pine cones.\n\nCap flat to rounded. Upper side brown to dark purplish brown, covered with dark brown fibrils. Under side spiny. Flesh thin, flexible. Spines light to dark brown.\nStem brown, hairy, rigid, joined laterally to the cap, swollen towards the base.", "Bankera fuligineoalba": "Dimensions Cap 5-10 cm diameter; stem 2-5 cm tall * 0.5-2 cm thick Description Medium-sized, yellowish brown, fleshy to fibrous cap with spiny under surface. \n\nCap convex at first, becoming flat or depressed at center. At first pallid, then brown with yellow or red tinges, remaining more pallid at the margin. Pine needles adhere to densely mattered surface fibrils. Flesh soft and brittle. Stem white at the apex, becoming dull brownish below, equal or tapered towards the base, downy, sometimes eccentric.\n\nSimilar species Bankera violascens has a clean, regularly shaped cap with lilac tints; it grown with spruce. Sarcodon species have colored spores.", "Calocera viscosa": "Dimensions 3-10 cm tall Description Yellow, antler-like, gelatinous fruiting bodies; in tufts or stumps and roots of coniferous trees. Branches are sometimes flattened and sometimes forked at tips.\nFruiting body golden-yellow when damp, more orange-yellow when dry, antler shaped with repeated dichotomous branching. The forks are somewhat slimy when wet.\n\nSimilar species Calocera cornea has small, unbrached clubs and grows on deciduous twigs. Calocera furcata is forked and grows on pine wood. Paler Calocera pallidospathulata is flattened and irregular. Gymnospoarngium clavariiforme, found on juniper, is less erect and without branches at the tips.", "Calocybe persicolor": "Dimensions Cap 3-5 cm diameter, stem 3-5 cm tall * 0.3-0.8 cm diameter Description A small, fleshy agaric with flesh-pink cap and white gills. It often grows on soil in grass in parks and mixed woods; it is less frequent in open grasslands.\n\nCap is dirty pink; at first convex, it expands with a somewhat irregular margin. Towards the margin, cap is smooth and covered with whitish dust or bloom. Flesh is white with pink tinge beneath cuticle. Gills are white, narrow and crowded.\nStem is pallid similarly colored as the cap. Its finely fibrillose surface hairy at the base, tapers slightly upwards.\n\nSimilar species Calocybe carnea is less dull without the hairy stem base.\n", "Chalciporus piperatus": "Dimensions Cap 3-5 cm diameter, stem 4-6 cm tall * 0.3-1 cm thick Description A very small bolete that is cinnamon-brown throughout, except for the chrome-yellow stem flesh; it does not stain blue on bruising. The slightly greasy cap is convex in shape, and the stem is slender; the tubes are 0.3-1 cm long. The flesh has an intensely hot and peppery flavor, making this species inedible, although is has been used as spice. Cap tubes are adnate to decurrent. Pores are angular cinnamon to rust brown. Spores are susty brown.\n\nSimilar species Chalciporus piparatoides it similar but can be distinguished by the blue bruising of its cap, tubes, and pores. Chalciporus amarellus has pinker coloring and a less peppery taste."}{"Clitocybe clavipes": "Dimensions Cap 4-8 cm diameter, stem 3-7 cm tall * 1-1.5 cm thick Description This medium-sized agaric has a brownish grey, funnel-shaped cap and white girls that extend downward. It grows solitary or in small troops on soil in broad-leaf woods, favorfavoring beech.\n\nCap is smooth and brownish, sometimes with grey or an olive tinge tinges; at first it is flattened convex with slight umbo, later shallowly funnel-shaped. Flesh is white, thick and watery.  Gills are pallid, creamy-yellow, close, fairly broad and deeply extended downward. Spores are white. Stem is more pallid but otherwise similarly colored as the cap. It is silky fibrous, tapering upwards strongly from a club-shaped base. Ring is absent. \n", "Clitocybe nebularis": "Dimensions Cap 8-20 cm diameter, stem 5-10 cm tall * 1.4-4 cm diameter Description Medium or large agaric, with cloud-grey, funnel-shaped cap and white, decurrent gills; typically in troops or rings on soil in  broad leaf or coniferous woods.\n\nCap soft cloud-grey, darker at the centre, sometimes with brownish tinge, smooth but whitish pruinose; at first flattened, convex, later flattened or shallowly depressed. Flesh whitish and thick. Gills white or buff, decurrent, broad, crowded. Stem concolorous with cap, fibrillose, stout, tapering upwards. Ring absent. Flesh white, thick, brittle, stuffed, becoming hollow. Odour strong, sweet or fruity. Taste not distinctive.\n\nSimilar species Entoloma sinuatum, which is poisonous.\n", "Collybia dryophila": "Dimensions Cap 2-6 cm diameter, stem 2-6 cm tall * 0.2-0.5 cm diameter Description This smallish agaric has a pale tan cap, whitish gills, and a flushed tan stem. The mushroom occurs in troops or more or less tufted on soil and scattered leaves under leafy and coniferous trees. \n\nCap is buff or tan, smooth, and hygrophanous; wrinkled when dry it is pallid and sometimes more or less white. It is convex, becoming expanded, flattened or slightly depressed with wavy margin. Flesh is whitish and thin. Gills are at first white, becoming buff; narrow and crowded, it reaches to the stem but is not attached.\nStem is more or less similarly colored as the cap, more or less equal but slightly bulbous at base. Ring is absent.\n\nSimilar species Collybia aquosa has pale pink rhizoids and Collybia ocior has a rather dark cap and pale yellow gills.\n", "Coltricia perennis": "Dimensions Cap 2-8 cm diameter, stem 0.2-1 cm thick * 1.3-3.5 cm tall Description This annual polypore is very unusual in that it grows in the soil rather than on dead wood.\nFruiting body upper surface zoned concentrically in shades of ochre, grey and rust with maroon tinge, disc-like, at first finely downy, becoming smooth with age; stem rusty-brown, downy, more or less central. Flesh brown, thin, corky, harder when dry.\n\nSimilar species Several tooth-fungi are similar above but have spiny undersides.", "Coprinus plicatilis": "Dimensions Cap 0.8–2 cm; stem 4-8 cm tall * 1-2 mm diameter Description Small, delicate, buff, parasol-like agaric. Grows solitary or scattered on soil in lawns and other short grass.\nCap buff, more cinnamon at the centre and later with gray tinge at the margin. At first ovoid or cylindrical, then campanulate and finally shallowly convex like a parasol, wholly flat, or slightly depressed at the centre. The surface is deeply sulcate, otherwise smooth, without velar remnants. Flesh very thin and fragile. Gills pallid clay, sometimes with pinkish tinge, soon grey and finally black, somewhat distant, separated from the stem apex by a distinct collar. Stem semi-translucent white or buff, particularly near the base, more or less equal, slender, with slight basal bulb. Ring absent.\n\nSimilar species Coprinus auricomus tends to be a bit bigger and has browner cap. A microscope reveals thick-walled brown hairs, confirming it's identity. Other similar species include Coprinus keuhneri, Coprinus leiocephalus and Coprinus nudiceps. They can be distinguished only by carefully measuring the spores.", "Cortinarius alboviolaceus": "Dimensions Cap 5-8 cm diameter, stem 5-12 cm tall * 1-2 cm thick Description This agaric has a convex to umbonate, fleshy, silvery violet cap. The twisted, often club-shaped stem is also silvery violet and is sometimes marked rust-brown around the veil zone by deposited spores. The rather broad, sinuate, notched gills are medium spaced and light gray-blue to cinnamon-brown. Grows with deciduous trees, but also found with conifers, often on acidic soil.\n\nSimilar species Cortinarius malachius has a slightly scaly cap. It is associated with conifers, as are Cortinarius camphoratus and Cortinarius tranganus, which are noted for their penetrating smells; the former reminiscent of half-rotten potatoes, the latter sweet and sticky.", "Cortinarius armillatus": "Dimensions Cap 4-12 cm diameter, stem 6-12 cm tall * 1-3 cm thick Description This medium or large agaric has a rust-brown, bell-shaped, fibrous cap, rust gills and reddish belts on stem with swollen base. It grows typically in acidic soil in heathy situations, typically with birch.\n\nCap is rust colored, darkening with age; it is at first hemispherical, becoming expanded, at first smooth, becoming radially fibrous-scaly, often with reddish cortinal remnants forming a belt at margin. Flesh is pallid and moderate. Gills are at first pallid cinnamon, becoming rust at maturity, broadly attached to the stem or notched at the margin, and fairly crowded. Spores are rusty brown. Stem is a pallid cap color streaked with fibrils, more or less equal but markedly swollen at base. Ring is made of velar remnants forming one or more orange-red median or inferior ring zones. Flesh is pallid but darker brown towards base, fibrous and full.\n\nSimilar species Cortinarius paragaudis is slightly smaller, with stem girdles of a dirtier red. It is associated with conifers.\n", "Cortinarius collinitus": "Dimensions Cap 6-10 cm diameter, stem 7-12 cm tall, 1-2.5 cm thick Description A orange-brown cap, which is convex or has a wavy margin, and a sturdy white stem are good indicators of this species. Both the cap and the white stem are covered in the slimy remains of the veil which is blue-tinged. The flesh is thick and white, and the gills are grey- to cinnamon-brown. The mushroom occurs with spruce.\n\nSimilar species Cortinarius mucosus."}{"Cortinarius laniger": "Dimensions Cap 3-8 cm diameter, stem 6-10 cm tall * 1-2 cm thick Description Medium sized agaric with dull, somewhat tomentose, reddish brown cap, rust -brown gills and pale brown, belted stem tinged lilac at the apex: solitary or in scattered trooping groups on wet mossy soil in or near upland coniferous woods.\n\nCap reddish -brown, dull, fibrillose and somewhat tomentose, barely hygrophanous, margin with white velar remnants; at first hemispherical becoming convex, sometimes with a slight umbo. Flesh whitish and moderate. Gills light ochraceous-brown, becoming rust -brown at maturity, adnate, broad. Spores rust colored. Stem pallid cap colour, woolly when young, becoming smooth decorated with a woolly annular zone with several white bands below, more or less equal or slightly clavate below. Flesh clay, brown in the base, fibrous, full. Taste not distinctive. Odour of radish.\n\nSimilar species Cortinarius caperatus, which is edible, has a distinctive and free ring.\n", "Cortinarius malicorius": "Dimensions Cap 1.5-5 cm diameter, stem 2-7 cm tall * 0.6-1.2 cm diameter Description The young gills of this Cortinarius are orange, which helps to separate it from many similar species.\nCap hemispherical then broadly convex; brownish cinnamon, margin more yellow; fibrillose to minutely scaly. Gills Attached to the stem but sometimes pulling away from it in age; close; orange at first, becoming cinnamon to rusty.\nStem middle slightly swollen at the base, soon hollow; bright yellow often with reddish area near the base; corona yellow. Flesh yellow. Odor slight. Taste slight. Habitat in coniferous woods.", "Cortinarius mucosus": "Dimensions Cap 6-10 cm diameter, stem 6-10 cm tall * 1-2.5 cm thick Description This medium to large agaric is very slimy with a yellowish brown cap, cinnamon or rust colored gills, a stout white stem with ring zone and slightly swollen base. It grows typically with pine or birch.\n\nCap is smooth, very sticky and ochre or honey with reddish tinge; it is at first convex, becoming expanded and sometimes shallowly depressed. Flesh is whitish and moderate. Gills are at first pallid whitish, then clay or rust colored at maturity. They are close and broadly attached to the stem. Spores are rusty brown. Stem is white with rust sub-apical cortinal zone. It is smooth or faintly scaly below cap, more or less equal or slightly swollen at base, and very sticky. Ring is absent and compact.\n\nSimilar species Cortinarius collinitus occurs with spruce. It has a blue -tinged slime on its stem. Other similar species grow under different host trees.\n", "Cortinarius traganus": "Dimensions Cap 5-8 cm diameter, stem 5-12 cm tall, 0.6-1.2 cm thick Description This agaric has a convex to umbonate, fleshy, silvery violet cap. The twisted, often club-shaped stem is also silvery violet and is sometimes marked rust-brown around the veil zone by deposit spores. The rather broad, sinuate, notched gills are medium spaced and light gray-blue to cinnamon-brown. \nMycorrhizal, usually with deciduous trees, but also found with conifers, often on acidic soil.\n\nSimilar species Cortinarius malachius has a slightly scaly cap. It is associated with conifers, as are Cortinarius camphoratus and Cortinarius alboviolaceus.", "Entoloma sericeum": "Dimensions Cap 2-4 cm diameter, stem 2-7 cm tall * 0.15-0.5 cm thick Description Small agaric with dark brownish grey cap and stem, pale gills. Grows solitary or in small trooping groups on soul in grass and open moorland.\n\nCap greyish brown, darker at the centre; campanulate, becoming expanded with small umbo, silky fibrous and often distinctly striate. Flesh same color as cap or more pallid . Gills at fist pallid grey, becoming pink tinged at maturity, adnexed or emarginate with decurrent tooth, close. Spores are pink. Stem same color as cap, more pallid at the apex and base, silky fibrillose, more or less equal, base slightly swollen. Ring absent. Flesh pallid concolorous and stuffed.\n\nSimilar species There are several Entoloma species that are similar in appearance, such as Entoloma cetratum, which is warmer honey brown and Entoloma conferendum which has star-shaped spores.", "Entoloma vernum": "Dimensions Cap 2-4 cm diameter, stem 2-7 cm tall * 0.2-0.6 cm thick Description Small agaric with grey-brown cap and stem, brown gills. Occurs mainly in spring, but also on summer and autumn, solitary or in small trooping groups in grasslands, often in the vicinity of conifers.\n\nCap grayish tan or darker; conical with a sharpish umbo, silky smooth. Flesh brown, thin and fragile. Gills tan-brown, emarginate or free, broad, close or more or less distant. Spores are pink colored. Stem pallid tan, slender, more or less equal, apex pruniose, otherwise silky fibrillose. Ring abcent. Flesh same color as surface, pithy or narrowly hollow.\n", "Hygrophoropsis aurantiaca": "Dimensions Cap 2-8 cm diameter, stem 3-5 cm tall * 0.5-1 cm thick Description This smallish orange-yellow agaric has a shallowly funnel-shaped cap reminiscent of a chanterelle but with true gills. It grows typically with conifers or on heaths.\n\nCap is orange-yellow; it is at first convex, becoming shallowly funnel-shaped, finely downy, and typically remaining more or less incurved at margin. Flesh is thin, tough and similarly colored as the cap. Gills are orange, extending downward, narrow, forked and crowded. Spores are off white. Stem is similarly colored as the cap. It is stout, more or less equal, smooth, and typically curved. Ring is absent.\n\nSimilar species Cantharellus cibarius, Omphalotus olearius \n", "Hypholoma capnoides": "Dimensions Cap 3-7 cm diameter, stem 5-8 cm tall, 0.5-1 cm thick Description The convex cap of this agaric is yellowish orange, drying to pale orange-brown, and has veil remnants visible at the pale margin. It is greasy when wet. The stem is pale yellow at the top and rusty brown at the bottom. This mushroom has mild-tasting, pale yellow flesh. Grows on strongly decayed conifer stumps. Cap yellowish orange to pale orange-brown. Gills pale grey to purplish brown. Spores are purplish brown.\n\nSimilar species Hypholoma radicosum is much rarer but is found in similar sites. "}{"Inocybe lacera": "Dimensions Cap 1-4 cm diameter, stem 2-4 cm tall * 0.2-0.5 cm thick Description This small, umbonate agaric has a yellowish brown, scaly cap, pale brownish gills and stem, and smooth spores. It grows often on sandy soil with coniferous trees and on old moss-covered fire sites.\n\nCap is variable, ochre or dark brown, scaly-fibrous, and radially splitting; it is convex, then expanding with a slight umbo. Flesh is whitish and unchanging. Gills are cream colored, becoming grey-brown with whitish edges. Crowded they are notched at the margin or reach towards but are not attached to the stem. Spores are tobacco brown. Stem is whitish or pallid brown, slender, and more or less equal. Ring is absent.\n\nSimilar species Inocybe lanuginosa has a woollier stem and spores with nodules.\n", "Lactarius camphoratus": "Dimensions Cap 2.5-5 cm diameter, stem 3-5 cm tall * 0.4-0.7 cm thick Description This smallish agaric has a reddish brown cap, pale gills and exudes milk which is curry-scented.\n\nCap is reddish or bay-brown, smooth and matte; it is at first convex with slightly incurved margin, later flattened or slightly depressed with small umbo. Flesh is thin, granular, brittle and pallid, colorsimilarly colored as the cap. Gills are pallid, coloralso similarly colored as the cap, extending downward, narrow, and crowded. Spores are white to cream colored. Stem is pallid and similarly colored as the cap, more or less equal, and finely downy. Ring is absent becoming hollow.\n\nSimilar species Lactarius rufus and Lactarius helvus have a similar smell.\n", "Lactarius lignyotus": "Dimensions Cap 2-10 cm diameter, stem 4-12 cm tall * 0.8 - 1.5 cm thick Description This dark brown, velvety Lactarius grows under conifers and features fairly well-spaced gills, a long stem that is nearly as dark as the cap, and white milk that usually stains the flesh and the gills pinkish.\n\nCap convex with a small point in the middle, becoming flat or shallowly depressed, often with a central depression and the central point remaining or disappearing; dry; finely velvety; often with a rugged or wrinkled surface; nearly black when young, dark brown to brown in age; the margin sometimes becoming ridged. Gills are attached to the stem or beginning to run down it; close or nearly distant; white or whitish, remaining pale until old age, when pinkish to orangish hues often result from drying milk and spore maturation; occasionally with brownish edges; usually staining slowly reddish to pinkish when damaged. Stem more or less equal; dry; textured and colored like the cap, except for a whitish base; often with small ribs at the apex.\n\nSimilar species Lactarius fuliginosus has a light brown stem, and the hat color is dark brown.", "Lactarius turpis": "Dimensions Cap 5-15 cm diameter, stem 4-8 cm tall * 1-2.5 cm thick Description This large, dull olive-brown agaric, is typically slimy or sticky and exuding milk. It grows solitary or in scattered groups on soil in damp places under birch.\n\nCap is a dull dark olive or umber-brown with a slightly more pallid margin; it is at first convex with inrolled margin, later flattened and then depressed. It is felt-like and even wooly at first and then becomes sticky. Flesh is whitish, discoloring brown. It is thick, granular, and brittle. Gills are buff, becoming sepia-tinged especially where bruised. They are fairly narrow, crowed and extending downward. Stem, more or less equal and tapering towards the base, becomes hollow. It is similarly colored as the cap but more pallid. It is slightly pitted and sticky. Ring is absent.\n", "Lepista nebularis": "Dimensions Cap 5-20 cm diameter, stem 5-10 cm tall * 1.5-2.5 cm thick Description Medium or large agaric; with cloud-grey, funnel-shaped cap and white, decurrent gills. Grows typically in troops or rings on soil in broad-leaf or coniferous woods.\n\nCap soft cloud-grey, darker at the middle, sometimes with brownish ting, smooth but whitish pruinose. It's first flattened, convex, later flattened or shallowly depressed. Flesh whitish and thick.  Gills white or buff, decurrent, broad and crowded. Stem colored as cap, fibrillose, stout, tapering upwards. Ring absent. Flesh white, thick, brittle, stuffed and becoming hollow.  \n\nSimilar species Entoloma sinuatum which is poisonous.", "Lycoperdon nigrescens": "Dimensions 1-4 cm diameter * 1.5-3 cm tall Description This smallish, dark brown, spiny, rounded structure has a short pedistal; it typically grows in troops on acid soil on heaths and in coniferous and mixed woods.\n\nFruiting body is pallid brown covered with dark brown spines. They are fused in groups at the tips, falling away to reveal a brown papery surface decorated with a faint net pattern. Through a sub-spherical opening through a pore at the apex, the fertile head tapers or pinches down into a distinct, but very short, sterile, spongy basal region. Spore mass is at first white and firm becoming brown and powdery.  Spores are brown.\n", "Megacollybia platyphylla": "Dimensions Cap 4-12 cm diameter, stem 6-15 cm tall * 1.5-2 cm thick Description This medium to large, fleshy agaric has a grey-brown, fibrillose cap, whitish gills and stem.\n\nCap is whitish and densely covered with gray-brown fibrils; it is at first bell-shaped, becoming expanded-convex, sometimes slightly umbonate. It darkens with age, splitting radially. Flesh is white, fragile and thin. Gills are white, becoming cream colored. Reaching to the stem but not attached, they are very broad and crowded. Spores are pale cream colored. Stem is hollow and whitish, with darker fine fibrils that are less dense than on cap. It is more or less equal and thickened at base. Ring is absent.\n\nSimilar species Pluteus cervinus has free gills and a salmon-pink spore print.\n", "Mycena galericulata": "Dimensions Cap 2-8 cm diameter, stem 5-10 cm tall * 0.2-0.4 cm thick Description This small or medium, grayish brown agaric has a bell-shaped, radially grooved cap and pinkish gills; it grows in clusters on stumps and woods, favoring broad-leaf trees, particularly oak, but also conifer stumps.\n\nCap is grayish brown with a more pallid margin; it is at first conical, becoming broadly umbonate. Flesh is whitish and thin. Gills are at first white, becoming flesh pink. They are broadly attached to the stem with broad, fairly distant tooth extending downward. Spores are pale cream colored. Stem is similarly colored as the cap but more pallid near the apex. It is smooth, slender, more or less equal, and somewhat rooting.  It has white hair. Ring is absent.\n"}{"Otidea onotica": "Dimensions 4-6 cm diameter * 4-10 cm tall Description This pinkish yellow, irregular ear grows solitary and in small trooping groups on soil in broad-leaf and mixed woods; they tend to grow under beech trees.\nFruiting body has a smooth, ochre with a pink tinge, cup-shaped inner surface; outer surface is mealy and also ochraceous; ear-shaped, it has one shorter side split vertically, and the margin tends to remain incurved. Stem is pallid, very short and stout. Flesh is pallid whitish, brittle and thin.\n\nSimilar species Otidea leporina is found mostly in conifer forests. The dark brown Otidea smithii is common in the Rocky Mountains. Wynnea americana, which grows from a sclerotial mass, is also dark brown but with a reddish inner surface.\n", "Paxillus atrotomentosus": "Dimensions Cap 12-28 cm diameter, stem 3-9 cm tall * 2-5 cm thick Description This large or massive agaric has a brown cap, buff gills and a dark brown, velvety, sometimes eccentric stem; it grows solitary or in small tufts on rotten, sometimes buried, coniferous wood.\n\nCap is snuff-brown with irregular, reddish-ochre patches; it is at first convex, becoming expanded and depressed but with persistently inrolled margin. It is finely downy, becoming smooth with age. Flesh is cream colored, thick and firm. Gills are at first buff, becoming ochre and spotted rust with age. They, extend downward, crowded and branched close to the stem giving a netted appearance. Spores are sienna-brown. Stem is at first an olive tinged and finely downy, becoming dark brown and more coarsely downy. It is equal, very stout, and eccentric. Ring is absent.\n", "Pholiota alnicola": "Dimensions Cap 2-8 cm diameter, stem 2-8 cm tall * 0.5-1 cm diameter Description This medium-sized agaric has a bright yellow, greasy cap, lemon-yellow gills becoming cinnamon, and a ring zone on stem; it grows solitary or more typically clustered on stumps and other dead wood of broad-leaf trees, favoring birch, alder and willow in damp locations.\n\nCap is bright yellow, sometimes with a slight an olive tinge at the margin; it is convex, becoming flattened. It mostly smooth but sometimes with pallid velar remnants at the margin. It is greasy when damp, otherwise dry. Flesh is yellow and firm. Gills are pallid yellow, becoming cinnamon at maturity. They are broadly attached to the stem and crowded. Spores are brown. Stem is pallid lemon-yellow, becoming tinged rust towards base, more or less equal, and smooth. Ring is zone-like with pallid remnants of veil, very superior.\n\nSimilar species Three forms of Pholiota alnicoloa are sometimes classified separately. Pholiota salicola grows on willow, and it tastes bitter; Pholiota flavida and Pholiota pinicola grow on conifers.\n", "Pholiota squarrosa": "Dimensions Cap 3-12 cm diameter, stem 5-12 cm tall * 1-1.5 cm thick Description The hat is yellow-white and covered with brown scales. The gills are light yellow to brown. The foot is the same color as the hat and protruding scales. Grows on hardwood, often at the base of live or dead hardwoods.\n\nCap straw-yellow covered in coarse, upturned, rust scales; convex, becoming flattened but with persistently inrolled margin, not greasy or viscid. Flesh pallid yellow and firm. Gills pallid yellow, becoming cinnamon at maturity, adnate, crowded. Spores are brown. Stem concolorous with cap above, becoming tinged rust towards the base, more or less equal or tapering downwards, scaly as cap. Ring ragged and almost zone-like.\n\nSimilar species Smaller and paler Pholiota squarrosoides is highly sticky-slimy beneath the scales. It also occurs on deciduous trees but is rare in Europe, more common in North America. Gymnopilys junonius found in the same habitat, lacks the distinctive cap scales.", "Polyporus ciliatus": "Dimensions Cap 2-12 cm diameter, stem 2-4 cm tall * 0.2-0.7 cm thick Description Small to medium-sized, brownish, funnel-shaped cap with white or pale buff pore-bearing under surface, annual. The mushroom arises from dead wood of broad-leaf trees, favoring logs and fallen branches laying on soil, on spring and early summer.\n\nFruiting body upper surface grayish brown or cigar-brown, convex with shallow central depression, smooth, with wavy, often incurved margin. Flesh whitish and leathery. Stem pallid, tawny, central, slender, more or less equal, typically curved and sometimes thickened at the base. Pores whitish cream to buff, circular, elongating with age.\n", "Psathyrella candolleana": "Dimensions Cap 2-6 cm diameter, stem 4-8 cm tall * 0.4-0.8 cm thick Description Smallish agaric with pale yellowish or cream cap and stem, grayish or chocolate-brown gills. Grows typically tufted on soil close to broad-leaf trees, also on stumps and other woody debris. The season for this mushroom is late spring to autumn.\n\nCap pallid ochraceous with brown tinge, drying cream or almost white; at first campanulate, becoming expanded, more or less flattened, smooth but typically with ragged velar remnants at the margin. Flesh white and thin. Gills at first pallid gray with lilaceous tinge, becoming chocolate-brown, adnate or adnexed, crowded. Spores are dark brown. Stem white, more or less equal, smooth. Ring absent. Flesh white, fragile and hollow.\n\nSimilar species The much darker Psathyrella spadiceogrisea occurs along forest paths and in similar sites in late spring and early summer.", "Psilocybe semilanceata": "Dimensions Cap 0.5-1.5 cm diameter, stem 2.5-7 cm tall * 0.1-0.2 cm thick Description Small, delicate agaric with distinctive yellowish pointed cap, clay or dark brown gills and long slender stem. Grows in scattered trooping groups, on soil amongst grass in lawns and pastures favoring hilly sites. The mushroom is hallucinogenic.\nCap pallid ochraceous-brown, hygrophanous, drying buff; conical with distinctive sharply pointed umbo, sticky when damp, smooth. Flesh pallid ochraceous and thin. Gills pallid clay, becoming purplish brown at maturity, adnate or emarginate, fairly distant. Spores are purplish brown. Stem pallid cream, occasionally tinged bluish at the base, slender, sometimes tortuous, more or less equal, smooth. Ring absent. Flesh pallid cream, fibrous and full. \n\nSimilar species Psilocybe fimetaria has a white veil at the margin. It grows in horse manure.", "Rhizina undulata": "Dimensions 2-10 cm diameter Description This large, irregular, brown or black cushion grows in fused clusters on conifer debris, particularly in old fire sites.\n\nFruiting body is dark brown ageing black, irregular and cushion-like. The margin is more pallid with an ochre underside and rootlike attachments; it is sessile or immobile. Flesh is reddish brown, tough and thick.\nOccurrence It is grows infrequently from early summer to early autumn.\n"}{"Rickenella swartzii": "Dimensions Cap 0.5-1 cm diameter, stem 2-4 cm tall * 0.1-0.2 cm thick Description This tiny species is pale fray to gray-brown; the cap center (navel) is almost black. The top of the stem is tinged dark violet. Grows in scattered trooping groups in lawns and other grasslands, typically with moss.\n\nCap ochraceous-cream or pallid brown with darker center; ta first convex, becoming flattened and finally depressed, striate when damp. Flesh cream, very thin. Gills pallid, deeply decurrent, broad, distant. Spores hyaline colored. Stem violaceous at apex, otherwise pallid ochraceous, finely downy, slender, more or less equal. Ring absent. Flesh cream, fragile and hollow.\n\nSimilar species Rickenella fibula is orange.", "Russula acrifolia": "Dimensions Cap 5-20 cm diameter, stemp 2-8 cm tall * 1-4 cm thick Description This large species has an gray to dark brown hat with a depressed center, and sturdy stem. The crumbly but firm flesh is off-white when cut, slowly turning red and then black. Its gills have a very sharp taste. The inedible Russula grows under various deciduous and coniferous trees.\n", "Strobilurus esculentus": "Dimensions Cap 1-2 cm diameter, stem 2-7 cm tall * 0.1-0.2 cm thick Description Small, delicate agaric with brown, conical cap and whitish gills. Grows solitary or in small groups, attached to buried or partly buried spruce cones. Note: this species never occurs on pine cones.\n\nCap dull brown; at first conical or convex, becoming flattened, smooth. Flesh white and thin. Gills whitish grey, adnexed, crowded. Stem pallid and coloured as cap, finely silky-pruinose, slender, tapering slightly upwards, typically deeply rooting. Ring absent. Flesh white, fragile and hollow.\n\nSimilar species Strobilurus stephanocystis and Strobilurus tenacellus favor pine cones.", "Strobilurus stephanocystis": "Dimensions Cap 1-2 cm diameter, stem 2-7 cm tall * 0.1-0.2 cm thick Description Small, delicate agaric with tawny-brown cap and whitish gills. Grows solitary or in small groups, attached to buried or partly buried pine cones.\n\nCap brown or tawny; at first convex, becoming flattened, smooth. Flesh white and thin. Gills whitish cream, adnexed, crowded. Stem pallid and coloured as cap, finely silky-pruinose, slender, tapering slightly upwards, typically deeply rooting. Ring absent. Flesh white, fragile and hollow.\n\nSimilar species Strobilurus esculentus favor spruce cones.", "Tricholoma focale": "Dimensions Cap 5-10 cm diameter, stem 6-8 cm tall * 1-1.5 cm thick Description This medium-sized, fleshy agaric is reddish orange with cream gills and a distinctively banded stem; it grows scattered or in small trooping groups on soil with pines in coastal locations.\n\nCap is reddish brown or orange tinged, with radiating scaly fibrils; slightly sticky, it is convex at first becoming flattened, sometimes with a slight umbo. Flesh is white and thick. Gills are cream colored, becoming more brown or brown-spotted with age; the margin is notched and crowded. Stem is pallid with  a creamy-brown girdle with scaly bands similarly colored as the cap, more or less equal then tapered at the base. Ring is similarly colored as the cap, woolly superior.\n", "Tricholoma sejunctum": "Dimensions Cap 4-10 cm diameter Description The green or brown cap of this species is moist and domed, flattening with age. It's surface has dark fibrils and is greasy in wet weather. The white stem develops yellow flushes with age, and the flesh is off-white, tinted yellow under the cap skin. It causes nausea if eaten.\n\nCap pallid, yellowish with fine, brownish or tan, radiating fibrils; at first convex, becoming flattened, with broad umbo, slightly sticky. Flesh white and thick. Gills whitish ochre, emarginate, very broad, crowded. Stem concolorous but more pallid, smooth, more or less equal or tapering upwards. Ring absent.\n\nSimilar species Tricholoma portentosum. The poisonous Amanita phalloides is distinguished by it's volva, stem ring, and free gills.", "Tricholomopsis decora": "Dimensions Cap 4-12 cm diameter, stem 3.5-5.5 cm tall * 1-1.5 cm thick Description Medium to large, fleshy agaric, cap with brown fibrils on a predominantly yellow background with brown to blackish scales, thinning towards the margin.\n\nCap egg-yellow, densely covered with brownish, firbrillose scales thinning towards the margin; at first convex, becoming broadly umbonate. Flesh pallid yellow and thin. Gills egg-yellow, adnexed very broad, crowded. Spores Spore print white. Stem yellow and covered with brownish, fibrillose scales, less densely than on cap, more or less equal. Ring absent.", "Tricholomopsis rutilans": "Dimensions Cap 2-12 cm diameter; stem 3.5-5.5 cm tall * 1-1.5 cm diameter Description Medium to large, fleshy agaric, cap with plum fibrils on custard yellow backround, gills egg -yellow: solitary or in small caespitose tufts on or close to rotting conifer stumps.\nCap egg -yellow, densely covered with reddish purple, fibrillose scales typically in tufts, thinning towards the margin: at first convex, becoming broadly umbonate. Flesh pallid yellow and thin. Gills egg -yellow, adnexed. very broad. crowded. Stem yellow and covered with reddish purple, fibrillose scales, less densely than on cap, more or less equal. Ring absent. Flesh pallid yellow, tough, stuffed or full.\nOdour of rotting wood. Taste not distinctive."}{"Tylopilus felleus": "Dimensions Cap 6-12 cm diamter, stem 7-10 cm tall * 2-3 cm diameter Description Slightly to distinctly pink pores on the underside of the bun-shaped brown cap and a dark net on the thick stem are characteristic of this bolete. It is also distinguished by a very bitter taste.\n\nCap snuff- or fulvous-brown; convex or bun-shaped, at first slightly downy then smooth and dry. Flesh whitish, with pinkish tinge beneath cap cuticle, unchanging, thick and firm. Stem pallid background with brown reticulation, stout and slightly bulbous. Ring absent.\n\nSimilar species When young this is easily mistaken for Boletus edulis, except that it is very bitter and has a dark stem net."}